FROM python:3.11-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Устанавливаем переменные окружения
#    PYTHONPATH=/app нужен, чтобы Python нашел /app/src
ENV PYTHONUNBUFFERED=1
ENV PYTHONPATH=/app

# 4. Копируем ТОЛЬКО файл с зависимостями для использования кэша Docker
COPY requirements.txt .

# 5. Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# 6. --- ИСПРАВЛЕНИЕ ЗДЕСЬ ---
#    Копируем ВЕСЬ КОНТЕКСТ СБОРКИ (включая папку `src`, `alembic` и т.д.)
#    в рабочую директорию `/app`.
#    Не забудьте использовать .dockerignore, чтобы не копировать мусор.
COPY . .

# 7. Команда по умолчанию для запуска приложения
#    Теперь эта команда будет работать, потому что /app/src будет существовать.
CMD ["uvicorn", "src.main:app", "--host", "0.0.0.0", "--port", "8000"]
